In [1]:
print("Hola")

Hola

In [1]:


import pandas as pd

# Datos en formato diccionario
datos = {
    "Nombre": ["Lucía", "Carlos", "María", "David", "Ana", "Pepe"],
    "Edad": [28, 35, 22, 41, 30, 18],
    "Sexo": ["F", "M", "F", "M", "F", "M"],
    "Ciudad": ["Madrid", "Barcelona", "Valencia", "Sevilla", "Bilbao", "Badajoz"],
    "Salario": [32000, 45000, 29000, 51000, 38000, 27000]
}

# Crear DataFrame
df = pd.DataFrame(datos)

print(df.head())

   Nombre  Edad Sexo     Ciudad  Salario
0   Lucía    28    F     Madrid    32000
1  Carlos    35    M  Barcelona    45000
2   María    22    F   Valencia    29000
3   David    41    M    Sevilla    51000
4     Ana    30    F     Bilbao    38000

In [2]:


# Guardar como CSV
df.to_csv("datos.csv", index=False)

In [3]:


df = pd.read_csv("datos.csv")
print(df.head())

   Nombre  Edad Sexo     Ciudad  Salario
0   Lucía    28    F     Madrid    32000
1  Carlos    35    M  Barcelona    45000
2   María    22    F   Valencia    29000
3   David    41    M    Sevilla    51000
4     Ana    30    F     Bilbao    38000

In [4]:
print(df.shape)
print(df.info())
print(df.columns)
print(df.describe())

(6, 5)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Nombre   6 non-null      object
 1   Edad     6 non-null      int64
 2   Sexo     6 non-null      object
 3   Ciudad   6 non-null      object
 4   Salario  6 non-null      int64
dtypes: int64(2), object(3)
memory usage: 372.0+ bytes
None
Index(['Nombre', 'Edad', 'Sexo', 'Ciudad', 'Salario'], dtype='object')
            Edad       Salario
count   6.000000      6.000000
mean   29.000000  37000.000000
std     8.390471   9486.832981
min    18.000000  27000.000000
25%    23.500000  29750.000000
50%    29.000000  35000.000000
75%    33.750000  43250.000000
max    41.000000  51000.000000

In [5]:
df.describe()

            Edad       Salario
count   6.000000      6.000000
mean   29.000000  37000.000000
std     8.390471   9486.832981
min    18.000000  27000.000000
25%    23.500000  29750.000000
50%    29.000000  35000.000000
75%    33.750000  43250.000000
max    41.000000  51000.000000